In [19]:
import os
from bs4 import BeautifulSoup as bs
import requests
import pymongo
from splinter import Browser
import pandas as pd
import time

In [20]:
# Make a reference to thecsv file path
csv_path = "NationalAnxietySurvey.csv"

# Import the books.csv file as a DataFrame
NAS_df = pd.read_csv(csv_path)
NAS_df.head()

,id,age,sex,literacy,martialstatus,recentbravement,employementstatus,socialeconomicstatus(0-5),familyhistory,anyaddiction,anychronicdesease,feel
0,1.0,35.0,f,y,y,n,y,2,y,n,n,NaN
1,2.0,45.0,m,y,y,y,y,5,n,y,n,NaN
2,3.0,35.0,m,y,y,n,y,0,n,n,y,NaN
3,4.0,56.0,m,y,y,n,y,1,n,n,n,NaN
4,5.0,45.0,m,y,y,n,y,0,y,n,n,NaN

In [21]:
NAS_df.columns.values

array(['id', 'age', 'sex', 'literacy ', 'martialstatus',
       'recentbravement', 'employementstatus',
       'socialeconomicstatus(0-5)', 'familyhistory', 'anyaddiction',
       'anychronicdesease', 'feel'], dtype=object)

In [34]:
NAS_df_c = NAS_df.drop(columns=['feel', 'martialstatus'])
NAS_df_c

,id,age,sex,literacy,recentbravement,employementstatus,socialeconomicstatus(0-5),familyhistory,anyaddiction,anychronicdesease
0,1.0,35.0,f,y,n,y,2,y,n,n
1,2.0,45.0,m,y,y,y,5,n,y,n
2,3.0,35.0,m,y,n,y,0,n,n,y
3,4.0,56.0,m,y,n,y,1,n,n,n
4,5.0,45.0,m,y,n,y,0,y,n,n
...,...,...,...,...,...,...,...,...,...,...
1967,NaN,NaN,NaN,NaN,NaN,NaN,5,NaN,NaN,NaN
1968,NaN,NaN,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN
1969,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,NaN,NaN
1970,NaN,NaN,NaN,NaN,NaN,NaN,2,NaN,NaN,NaN
1971,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,NaN,NaN

In [33]:
NAS_df_c.dropna(how='all')

,id,age,sex,literacy,recentbravement,employementstatus,socialeconomicstatus(0-5),familyhistory,anyaddiction,anychronicdesease
0,1.0,35.0,f,y,n,y,2,y,n,n
1,2.0,45.0,m,y,y,y,5,n,y,n
2,3.0,35.0,m,y,n,y,0,n,n,y
3,4.0,56.0,m,y,n,y,1,n,n,n
4,5.0,45.0,m,y,n,y,0,y,n,n
...,...,...,...,...,...,...,...,...,...,...
1967,NaN,NaN,NaN,NaN,NaN,NaN,5,NaN,NaN,NaN
1968,NaN,NaN,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN
1969,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,NaN,NaN
1970,NaN,NaN,NaN,NaN,NaN,NaN,2,NaN,NaN,NaN
1971,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,NaN,NaN

In [57]:
#NAS_df_c = NAS_df_c.apply (pd.to_numeric, errors='coerce')
NAS_df_c = NAS_df_c.dropna(['id'] == True )

AttributeError: 'function' object has no attribute 'dropna'